Repository: harheem/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/tutorials/machine_learning/qgans_for_loading_random_distributions.po
Languages: fr_fr

source: This page was generated from `tutorials/machine_learning/qgans_for_loading_random_distributions.ipynb`__.
fr_fr: Cette page a été générée depuis `tutorials/machine_learning/qgans_for_loading_random_distributions.ipynb`__.

source: **qGANs for Loading Random Distributions**
fr_fr: **qGANs pour le chargement aléatoire de distributions (Loading Random Distributions)**

source: Given :math:`k`-dimensional data samples, we employ a quantum Generative Adversarial Network (qGAN) to learn the data's underlying random distribution and to load it directly into a quantum state:
fr_fr: A partir des données d'exemple :math:`k`-dimensional, nous utilisons un réseau antagoniste génératif quantique (quantum Generative Adversarial Network (qGAN)) pour apprendre la distribution aléatoire sous-jacente des données et la charger directement dans un état quantique:

source: where :math:`p_{\theta}^{j}` describe the occurrence probabilities of the basis states :math:`\big| j\rangle`.
fr_fr: où :math:`p_{\theta}^{j}` décrit la probabilité de l'occurrence des états de base :math:`\big| j\rangle`.

source: The aim of the qGAN training is to generate a state :math:`\big| g_{\theta}\rangle` where :math:`p_{\theta}^{j}`, for :math:`j\in \left\{0, \ldots, {2^n-1} \right\}`, describe a probability distribution that is close to the distribution underlying the training data :math:`X=\left\{x^0, \ldots, x^{k-1} \right\}`.
fr_fr: Le but de l'apprentissage qGAN est de générer un état :math:`\big| g_{\theta}\rangle`où :math:`p_{\theta}^{j}`, pour :math:`j\in \left\{0, \ldots, {2^n-1} \right\}`, décrit la probabilité de distribution qui est proche de la distribution sous-jacente des données d'apprentissage :math:`X=\left\{x^0, \ldots, x^{k-1} \right\}`.

source: For further details please refer to Quantum Generative Adversarial Networks for Learning and Loading Random Distributions. Zoufal, Lucchi, Woerner. 2019.
fr_fr: Pour plus de détails, merci de vous référer à "Réseaux Antagonistes Génératifs Quantique pour l'Apprentissage et le chargement de distribution aléatoire" (Quantum Generative Adversarial Networks for Learning and Loading Random Distributions). Zoufal, Lucchi, Woerner. 2019.

source: How to use a trained qGAN in an application, i.e., pricing of financial derivatives, is illustrated here: qGAN Option Pricing.
fr_fr: Comment utiliser et entrainer qGAN dans une application, par exemple, la tarification des dérivés financiers, illustrée ici : option de tarification Gan.

source: Load the Training Data
fr_fr: Chargement des données d'apprentissage

source: First, we need to load the :math:`k`-dimensional training data samples (here k=1). Next, the data resolution is set, i.e. the min/max data values and the number of qubits used to represent each data dimension.
fr_fr: Premièrement, nous avons besoin de charger les données d'exemple d'apprentissage :math:`k`-dimensional (ici k=1). Ensuite, les données de résolution sont positionnées, par exemple, les valeurs min/max et le nombre de qbits utilisés pour représenter chaque dimension des données.

source: Initialize the qGAN
fr_fr: Initialiser le qGAN

source: The qGAN consists of a quantum generator :math:`G_{\theta}`, a variational quantum circuit, and a classical discriminator :math:`D_{\phi}`, a neural network. To implement the quantum generator, we choose a depth-\ :math:`1` variational form that implements :math:`R_Y` rotations and :math:`CZ` gates which takes a uniform distribution as an input state. Notably, for :math:`k>1` the generator's parameters must be chosen carefully. For example, the circuit depth should be :math:`>1` because higher circuit depths enable the representation of more complex structures. The classical discriminator is given by a :math:`3`-layer neural network that applies linear transformations, leaky ReLU functions in the hidden layers and a sigmoid function in the output layer. Notably, the neural network is implemented with PyTorch. Please refer to https://pytorch.org/get-started/locally/ for PyTorch installation instructions. Here, both networks are updated with the ADAM optimization algorithm.
fr_fr: Le qGAN consiste en un générateur quantique :math:` G_ {\theta } `, un circuit quantique variationnel, et un discriminateur classique :math:` D_ { \phi } `, un réseau neuronal. Pour mettre en oeuvre le générateur quantique, nous choisissons une forme de profondeur-\ :math:` 1 ` variationnelle qui implémente :math:` R_Y rotations et :math:` CZ ` portes qui prend une distribution uniforme en tant qu'état d'entrée. Notamment, pour :math:` k> 1, les paramètres du générateur doivent être choisis avec soin. Par exemple, la profondeur du circuit doit être :math:` >1 ` car des profondeurs de circuit plus élevées permettent la représentation de structures plus complexes. Le discriminateur classique est donné par un réseau neuronal :math:` 3 qui applique des transformations linéaires, des fonctions de ReLU qui fuient dans les couches cachées et une fonction sigmoïde dans la couche de sortie. Notamment, le réseau neuronal est mis en œuvre avec PyTorch. Veuillez consulter le site https://pytorch.org/get-started/locally/ pour les instructions d'installation de PyTorch. Ici, les deux réseaux sont mis à jour avec l'algorithme d'optimisation ADAM.

source: Run the qGAN Training
fr_fr: Exécuter la formation qGAN

source: During the training the discriminator's and the generator's parameters are updated alternately w.r.t the following loss functions:
fr_fr: Pendant la formation, les paramètres du discriminateur et du générateur sont mis à jour alternativement avec les fonctions de perte suivantes:

source: L_G\left(\phi, \theta\right) = -\frac{1}{m}\sum\limits_{l=1}^{m}\left[\log\left(D_{\phi}\left(g^{l}\right)\right)\right] and
fr_fr: L_G \left (\phi, \theta\right) =-\frac{1}{m}\sum\limits_ { l= 1 } ^{m}\left [ \log\left (D_ { \phi } \left (g ^{l}\right)\right)\right ] et

source: L_D\left(\phi, \theta\right) = \frac{1}{m}\sum\limits_{l=1}^{m}\left[\log D_{\phi}\left(x^{l}\right) + \log\left(1-D_{\phi}\left(g^{l}\right)\right)\right], with :math:`m` denoting the batch size and :math:`g^l` describing the data samples generated by the quantum generator.
fr_fr: G_D\left(\phi, \theta\right) = \frac{1}{m}\sum\limits_{l=1}^{m}\left[\log D_{\phi}\left(x^{l}\right) + \log\left(1-D_{\phi}\left(g^{l}\right)\right)\right], avec :math:`m` indiquant la taille du lot et :math:`g^l` décrivant les échantillons de données générés par le générateur quantique.

source: Please note that the training will take a while (:math:`\sim 20` min).
fr_fr: Veuillez noter que la formation prendra un certain temps (:math:` \sim 20 ` min).

source: Training Progress & Outcome
fr_fr: Progrès & Résultats de la formation

source: Now, we plot the evolution of the generator's and the discriminator's loss functions during the training as well as the progress in the relative entropy between the trained and the target distribution. Finally, we also compare the cumulative distribution function (CDF) of the trained distribution to the CDF of the target distribution.
fr_fr: Maintenant, nous tracons l'évolution des fonctions de perte du générateur et du discriminateur pendant la formation ainsi que la progression de l'entropie relative entre la distribution formée et la distribution cible. Enfin, nous comparons également la fonction de distribution cumulative (CDF) de la distribution entraînée au CDF de la distribution cible.
